# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'epk/epk'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'starship'
brew 'zsh'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'postgresql@14'
brew 'nvm'

# Apps
cask '1password'
cask 'github'
cask 'phpstorm'
cask 'ray'
#cask 'slack'
cask 'the-unarchiver'
cask 'transmit'
cask 'visual-studio-code'
cask 'notion'
cask 'spotify'
cask 'rectangle'
cask 'iterm2'
cask 'tower'
cask 'postico'
cask 'discord'
cask 'raycast'
cask 'grammarly'
cask 'tuple'
cask 'whatsapp'
cask 'vlc'
cask 'figma'
cask 'cleanmymac'
cask 'miro'
cask 'rectangle'
cask 'bartender'

# Browsers
cask 'firefox'
cask 'microsoft-edge'
#cask 'google-chrome'

# Fonts
cask 'font-sf-mono'
cask 'font-hack-nerd-font'
cask 'font-sf-mono-nerd-font'
